gitub/PoiseuilleTube/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O p e n        | Version: compatible with any OpenFOAM version   |
|   \\  /    A nd           |                                                 |
|    \\/     M esh          |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0]; // m/s

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.05 0 0); // écoulement dans x
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }

    axis
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}
