gitub/PoiseuilleTube/system/blockMeshDict
// system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Website:  https://OpenFOAM.org
|   \\  /    A nd           | Version:  2412
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0     0     0)
    (1.5   0     0)
    (1.5   0.01  0)
    (0     0.01  0)
    (0     0     0.001)
    (1.5   0     0.001)
    (1.5   0.01  0.001)
    (0     0.01  0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    axis
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
